In [8]:
import numpy as np
import pandas as pd
import seaborn as sns

In [9]:
df=sns.load_dataset("titanic")

In [11]:
df.head()  #ik dört index

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [12]:
df.ndim

2

In [19]:
df.isnull()

(891, 15)

In [23]:
df=df.dropna()  # bütün null ları sil
df.shape

(182, 15)

In [24]:
df.shape  #182 satır 15 sütün kaldı

(182, 15)

In [25]:
type(df)

pandas.core.frame.DataFrame

In [27]:
df.dtypes  #tipleri aldık güzell

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [28]:
df.head() #başlıklarda null olamyanalı alınca index

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
10,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
11,1,1,female,58.0,0,0,26.5500,S,First,woman,False,C,Southampton,yes,True

In [30]:
df.groupby("survived").mean() # hayatta kalma ort

,pclass,age,sibsp,parch,fare,adult_male,alone
survived,,,,,,,
0,1.220339,41.288136,0.372881,0.457627,64.532131,0.898305,0.508475
1,1.178862,32.905854,0.512195,0.487805,85.821107,0.276423,0.390244

In [31]:
df.groupby("survived").mean().T # hayatta kalma ort tranpoz

survived            0          1
pclass       1.220339   1.178862
age         41.288136  32.905854
sibsp        0.372881   0.512195
parch        0.457627   0.487805
fare        64.532131  85.821107
adult_male   0.898305   0.276423
alone        0.508475   0.390244

In [33]:
df.groupby("sex")["survived"].mean() # cinsiyeete hayatta kalma ort

sex
female    0.931818
male      0.436170
Name: survived, dtype: float64

In [36]:
df.groupby("sex")["survived"].mean()

sex
female    0.931818
male      0.436170
Name: survived, dtype: float64

In [44]:
df["survived"].groupby([df["sex"],df["pclass"]]).value_counts().unstack()

survived        0   1
sex    pclass
female 1        3  71
       2        1   8
       3        2   3
male   1       48  35
       2        2   4
       3        3   2

In [ ]:
# df de survived değ git, grup yapacak,hem cinsiyet
# hemde classda işlem yap say ve tablo olarak görselleştir

In [47]:
df["sex"].value_counts()   # dropna null silinince

male      94
female    88
Name: sex, dtype: int64

In [55]:
df.groupby(["sex","pclass"])["survived"].value_counts().unstack()
# dropna ya göre bayanların 71 i hayatta

survived        0   1
sex    pclass
female 1        3  71
       2        1   8
       3        2   3
male   1       48  35
       2        2   4
       3        3   2

In [54]:
df["survived"].groupby([df["sex"],df["pclass"]]).mean().unstack().T
# dropna ya göre bayanların %95 i hayatta

sex       female      male
pclass
1       0.959459  0.421687
2       0.888889  0.666667
3       0.600000  0.400000

In [57]:
df.groupby("sex")["pclass"].value_counts().unstack()

pclass   1  2  3
sex
female  74  9  5
male    83  6  5

In [58]:
df.groupby("sex")["survived"].value_counts().unstack()

survived   0   1
sex
female     6  82
male      53  41

In [59]:
df.groupby(["sex","pclass"])["survived"].mean().unstack()

pclass         1         2    3
sex
female  0.959459  0.888889  0.6
male    0.421687  0.666667  0.4

In [67]:
df.groupby(["survived","sex"])["age"].mean().unstack()

sex          female       male
survived
0         27.500000  42.849057
1         33.054878  32.607805

In [72]:
df.groupby(["survived","age"])["sex"].value_counts().unstack()

sex            female  male
survived age
0        2.0      2.0   NaN
         18.0     NaN   1.0
         19.0     NaN   3.0
         21.0     NaN   1.0
         24.0     NaN   2.0
...               ...   ...
1        56.0     1.0   1.0
         58.0     3.0   NaN
         60.0     1.0   1.0
         63.0     1.0   NaN
         80.0     NaN   1.0

[88 rows x 2 columns]

In [71]:
df["age"]

1      38.0
3      35.0
6      54.0
10      4.0
11     58.0
       ...
871    47.0
872    33.0
879    56.0
887    19.0
889    26.0
Name: age, Length: 182, dtype: float64